[  
  {
    "version": "v0.9.1",
    "date": "09/04/2025",
    "content": "Made event name input more robust by capliatlising event names while compensating for acronyms.\nPlaced limits on the date of events to between 8 years in the past and 7 days in the future. This prevents incorrect user date input when tryping the date of an event."
  },
  {
    "version": "v0.9.2",
    "date": "09/04/2025",
    "content": "Added some input strngthening when adding a new cadet so that inputs are automatically trimmed and capitalised.\nEnabled compatibility for multi-name forenames and hyphenated names.\nEnabled ability to edit cadet details. If a cadet's name is changes, all events under that name have the name field changed so names changes are pushed to all dashboards."
  },
  {
    "version": "v0.9.3",
    "date": "09/04/2025",
    "content": "Added a Change Log to decribe and log releases to the user. Versions in the change log used to inform the version number in the bottom right of the app."
  },
  {
    "version": "v0.10.0",
    "date": "10/04/2025",
    "content": "Users can now add badges by clicking on empty cells in the PTS Tracker. Currently a bug exists where a badge added on the PTS Tracker, they must refresh the tracker before remvoing the event from the Mass Event Log. The Badge displays correctly in the Mass Event Log, the End of Year Certificate and counts towards Flight Points."
  },
  {
    "version": "v0.10.1",
    "date": "10/04/2025",
    "content": "Made changelog show versions in correct order (where v0.10.x shows after v0.9.x)."
  },
  {
    "version": "v0.10.2",
    "date": "11/04/2025",
    "content": "Fixed bug where the setEvent function (used to add badges via the PTS Tracker) did not properly save events to data context meaning they had could not be deleted without refreshing the page."
  },
  {
    "version": "v0.10.3",
    "date": "11/04/2025",
    "content": "Made mass event log use same function as PTS Tracker to add event.\nRefactored save event function to a react hook to make it easier to use in multiple components.\nAdded duplicate event/badge/exam protection by showing a warning in the console when the user attempts to add a duplicate record. Warning does not show as popup or alert for a smoother user experience."
  },
  {
    "version": "v0.10.4",
    "date": "11/04/2025",
    "content": "Users can now add classification records/exams to a cadet's record directly using the Classification Tracker by clicking on a cadet (graph scatter point or table row) and adding 1 or more exams/records. These additions are saved to the database and are reflected in the Mass Event Log, End of Year Certificate and Flight Points dashboard."
  },
  {
    "version": "0.11.0",
    "date": "12/04/2025",
    "content": "Edited database formatting to enable Firestore rules. This included changes to database structure and the specific collections written to when new and existing users access the tracker."
  },
  {
    "version": "0.11.1",
    "date": "14/04/2025",
    "content": "Fixed bug where adding events to PTS Tracker when the badge category had two words (i.e. First Aid) would only save as the first part of the badge category (i.e. Blue First)."
  },
  {
    "version": "0.11.2",
    "date": "30/04/2025",
    "content": "Updated list of acronyms for record auto-formatting to include 'MOI'."
  },
  {
    "version": "0.11.3",
    "date": "30/04/2025",
    "content": "Added a new feature to the PTS Tracker that allows users to filter by time range or show all. Also added totals row to each column. This will make it easier to get PTS insights and for reporting during administrative inspections."
  }
]